// React는 node.js 기반의 javascript 라이브러리이다.

// HTML의 역할
// - 요소들의 내용, 배치, 모양을 정하기 위해 사용하는 언어
// - 색상이나 디자인 등의 수정은 불가

// CSS의 역할
// - 요소들의 색상, 크기 등의 스타일을 설정할 수 있음

// JS의 역할
// - 웹 내부에서 발생하는 다양한 기능을 만들 수 있는 언어
// - 웹을 움직이게 하는 "웹의 근육" 이라고 표현할 수 있음

// JS는 어떻게 실행될까?
// - JS는 Js엔진에 의해 실행된다.
// - JS엔진은 브러우저에 기본 탑재되어 있다.
// 따라서 웹 브라우저를 이용하면 간단한 JavaScript 코드를 직접 실행해 볼 수 있다.

// error lens 설치하면 오류 문장이 바로 옆에 나옴.

// html파일 안에 script 태그는 자바스크립트 파일을 불러오는 태그이다.

// html파일 안에서 live server를 사용해서 페이지 변경을 실시간으로 확인할 수 있다. 
// 종료를 원할경우 하단에 port:5050을 종료해주면됨.
// 실행은 무조건 html파일 안에서 해야함.

// 변수와 상수는 값을 저장하는 박스임.
// 중복된 이름으로 변수를 선언할 수 없다.

// let은 변수, const는 상수
// let은 값을 재정의 할 수 있지만, const는 재정의 할 수 없다.